# mysql
DB_KTV = 'erp'
MYSQL_KTV = {
    'master': {
        'host': '127.0.0.1',
        'user': 'mombaby',
        'pass': '098f6bcd4621d373cade4e832627b4f6',
        'port': 3308
    },
    'slaves': [
        {
            'host': '127.0.0.1',
            'user': 'mombaby',
            'pass': '098f6bcd4621d373cade4e832627b4f6',
            'port': 3308
        }
    ],
    'dbs': [DB_KTV]
}


# error msg
ERR = {
    200: '请求成功',
    10000: '应用上线前请使用测试环境进行开发联调',
    10001: '请求参数错误',
    10002: '需等上一笔提现打款',
    10003: '验证码错误',
    10004: 'ktv已被其他代理商激活',
    10005: '您没有抽奖机会',
    10006: '活动没有在进行中',
    11001: '优惠券经验证, 无法使用',
    11002: '使用优惠券失败',
    12001: '验证码调用次数过多，请明天再试',
    19002: '房型已售空',
    19003: '支付失败，稍后再试',
    19004: '查单失败，稍后再试',
    19005: '未登录',
    19006: '酒水下单失败, 请检查房台名是否正确',
    19007: '红包发放失败',
    19008: '正在开台中，请稍后刷新页面',
    18001: '美女包养失败',
    40001: '请先在发布平台配置ktv',
    40002: '操作不合法，购买/领取数量超过剩余数量',
    40003: '频率过高',
    40004: '余额不足',
    40005: '您不是主宰',
    40006: '地址已过期',
    40007: '法官已经被别人抢走',
    50000: '暂时无法获取到歌厅数据，请稍后再试',
    50001: '开放平台服务异常，请稍后再试',
    50002: '歌厅房间不可用，请稍后再试',
    50003: '该订单已被使用',
    50004: '歌厅网络预订接口未授权',
    50005: '歌厅此功能被禁用',
    50006: '访问频率过高',
    50007: '产品列表拉取失败',
}